Revit 2027 API
StairsType.NotchVerticalGap Property
 The width of the vertical gap in the stairs notch.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double NotchVerticalGap { get; set; }
Public Property NotchVerticalGap As Double
	Get
	Set
public:
property double NotchVerticalGap {
	double get ();
	void set (double value);
}
member NotchVerticalGap : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for notchVerticalGap must be between 0 and 30000 feet.
InvalidOperationException |  When setting this property: The construction method of the stairs type is not "Precast" or the StairsEndConnectionType of the stairs type is not "Notch", so this related data cannot be set.
See Also
Reference
StairsType Class
Autodesk.Revit.DB.Architecture Namespace